In [14]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame()
df['Batsmen'] = ["Sachin","Dhoni","Sachin","Dhoni","Sachin"]
df['Score'] = ["4","6","1","0","4"]
df['count'] = [1]*len(df)
df

  Batsmen Score  count
0  Sachin     4      1
1   Dhoni     6      1
2  Sachin     1      1
3   Dhoni     0      1
4  Sachin     4      1

In [29]:
unique_A = list(df['Score'].unique())
tmp_file = "File_loc%s.csv"
for i in unique_A:
    print (tmp_file%i)

File_loc4.csv
File_loc6.csv
File_loc1.csv
File_loc0.csv

In [27]:
for i in unique_A:
    df[i] = np.where(df['Score']==i,1,0)
df

  Batsmen Score  count  4  6  1  0
0  Sachin     4      1  1  0  0  0
1   Dhoni     6      1  0  1  0  0
2  Sachin     1      1  0  0  1  0
3   Dhoni     0      1  0  0  0  1
4  Sachin     4      1  1  0  0  0

In [22]:
df.pivot_table(columns="Score",index="Batsmen",values = "count")

Score      0    1    4    6
Batsmen
Dhoni    1.0  NaN  NaN  1.0
Sachin   NaN  1.0  1.0  NaN